TwoPhaseFlow-master/run/benchmark/surfaceTension/curvatureCircle/curvature2DTri/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

. $WM_PROJECT_DIR/bin/tools/RunFunctions

touch curvature.foam
gmshv306 -3 triSquare.geo 
echo '$End' >> triSquare.msh 
runApplication gmshToFoam triSquare.msh 
runApplication changeDictionary
restore0Dir 

runApplication $(getApplication)

